NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
#include "hardware/BaseEspnow_sender.h"

#include <Preferences.h>
#include <WiFi.h>
#include <cstring>
#include <esp_now.h>
#include <esp_system.h>
#include <esp_wifi.h>
#include <freertos/queue.h>
#include <freertos/semphr.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#include "Prog_Config.h"
#include "RtcmEspNowProtocol.h"
#include "functions/Rtcm_Frame_Reader.h"

namespace {
struct RoverPeer {
    uint8_t mac[6];
    bool stored;
    bool rtcmEnabled;
    uint8_t consecutiveFrameFailures;
    uint32_t cooldownUntilMs;
};

struct QueuedGnssCommand {
    uint8_t roverMac[6];
    uint32_t transactionId;
    uint32_t surveyDurationSeconds;
    uint8_t commandId;
};

struct TempRtcmRxPacket {
    uint8_t sourceMac[6];
    uint16_t length;
    uint8_t data[RTCM_ESPNOW_MAX_PACKET_SIZE];
};

struct TempRtcmReassemblyState {
    bool active;
    uint16_t streamId;
    uint32_t frameSequence;
    uint16_t frameLength;
    uint8_t fragmentCount;
    uint8_t receivedMask;
    uint32_t startedAtMs;
    uint8_t frame[RTCM_ESPNOW_MAX_FRAME_LENGTH];
};

BaseEspnowStats stats;
RoverPeer roverPeers[ESPNOW_MAX_PAIRED_ROVERS] = {};
BaseRoverLlhStatus latestRoverLlh[ESPNOW_MAX_LLH_SOURCES] = {};
size_t roverPeerCount = 0;
portMUX_TYPE statsMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE peerMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE llhMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE pairingMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE sourceMux = portMUX_INITIALIZER_UNLOCKED;
uint16_t streamId = 0;
uint32_t frameSequence = 0;
volatile bool lastSendSucceeded = false;
volatile bool waitingForFrameAck = false;
volatile uint16_t expectedAckStreamId = 0;
volatile uint32_t expectedAckSequence = 0;
uint8_t expectedAckMac[6] = {};
SemaphoreHandle_t sendCallbackSemaphore = nullptr;
SemaphoreHandle_t frameAckSemaphore = nullptr;
SemaphoreHandle_t espnowSendMutex = nullptr;
SemaphoreHandle_t gnssCommandResultSemaphore = nullptr;
QueueHandle_t gnssCommandQueue = nullptr;
QueueHandle_t gnssCommandResultQueue = nullptr;
QueueHandle_t tempRtcmRxQueue = nullptr;
QueueHandle_t tempRtcmFrameQueue = nullptr;
portMUX_TYPE gnssCommandMux = portMUX_INITIALIZER_UNLOCKED;
volatile bool waitingForGnssCommandResult = false;
uint8_t expectedGnssCommandMac[6] = {};
uint32_t expectedGnssCommandTransactionId = 0;
uint8_t expectedGnssCommandId = 0;
uint32_t lastNoRtcmPeerWarningAtMs = 0;
size_t nextPeerStartIndex = 0;

BaseRtcmSourceSnapshot rtcmSource{};
uint32_t tempSurveyReadyAtMs = 0;
uint8_t tempCycleMsmMask = 0;
bool tempCycleStarted = false;

constexpr uint8_t BROADCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

bool pairingButtonReady = false;
bool pairingActive = false;
bool pendingPairResponse = false;
uint32_t pairingEndsAtMs = 0;
uint32_t pairingBaseNonce = 0;
uint32_t lastDiscoverySentAtMs = 0;
uint8_t pendingPairResponseMac[6] = {};
RtcmEspNowPairResponse pendingPairResponsePacket{};

void incrementStat(uint32_t BaseEspnowStats::*member, uint32_t amount = 1)
{
    portENTER_CRITICAL(&statsMux);
    stats.*member += amount;
    portEXIT_CRITICAL(&statsMux);
}

void setPairingActiveStat(bool active)
{
    portENTER_CRITICAL(&statsMux);
    stats.pairingActive = active;
    portEXIT_CRITICAL(&statsMux);
}

void updatePeerStats()
{
    portENTER_CRITICAL(&peerMux);
    const size_t count = roverPeerCount;
    uint32_t storedCount = 0;
    uint32_t rtcmEnabledCount = 0;
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (roverPeers[index].stored) {
            ++storedCount;
        }
        if (roverPeers[index].rtcmEnabled) {
            ++rtcmEnabledCount;
        }
    }
    portEXIT_CRITICAL(&peerMux);

    portENTER_CRITICAL(&statsMux);
    stats.activeRoverCount = static_cast<uint32_t>(count);
    stats.storedRoverCount = storedCount;
    stats.rtcmEnabledRoverCount = rtcmEnabledCount;
    portEXIT_CRITICAL(&statsMux);
}

void recordFrameSendDuration(uint32_t durationMs)
{
    portENTER_CRITICAL(&statsMux);
    stats.lastFrameSendMs = durationMs;
    if (durationMs > stats.maxFrameSendMs) {
        stats.maxFrameSendMs = durationMs;
    }
    portEXIT_CRITICAL(&statsMux);
}

bool macIsConfigured(const uint8_t* mac)
{
    return mac != nullptr &&
           (mac[0] != 0 || mac[1] != 0 || mac[2] != 0 ||
            mac[3] != 0 || mac[4] != 0 || mac[5] != 0);
}

bool macEquals(const uint8_t* a, const uint8_t* b)
{
    return a != nullptr && b != nullptr && std::memcmp(a, b, 6) == 0;
}

String macToString(const uint8_t* mac)
{
    if (mac == nullptr) {
        return String("<null>");
    }
    char buffer[18];
    snprintf(buffer, sizeof(buffer), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(buffer);
}

uint16_t newStreamId()
{
    uint16_t value = 0;
    while (value == 0) {
        value = static_cast<uint16_t>(esp_random() & 0xFFFFU);
    }
    return value;
}

uint16_t rtcmMessageId(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 5) {
        return 0;
    }
    return static_cast<uint16_t>((static_cast<uint16_t>(frame[3]) << 4) |
                                 (static_cast<uint16_t>(frame[4]) >> 4));
}

bool validateCompleteRtcmFrame(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 6 || length > RTCM_ESPNOW_MAX_FRAME_LENGTH ||
        frame[0] != 0xD3 || (frame[1] & 0xFCU) != 0) {
        return false;
    }
    const size_t payloadLength =
        (static_cast<size_t>(frame[1] & 0x03U) << 8) | frame[2];
    if (length != payloadLength + 6) {
        return false;
    }
    const uint32_t expected =
        (static_cast<uint32_t>(frame[length - 3]) << 16) |
        (static_cast<uint32_t>(frame[length - 2]) << 8) |
        static_cast<uint32_t>(frame[length - 1]);
    return rtcmCrc24q(frame, length - 3) == expected;
}

void rotateDownstreamStreamLocked()
{
    streamId = newStreamId();
    frameSequence = 0;
}

void beginTempPreparing(const uint8_t* mac, uint32_t surveyDurationSeconds)
{
    const uint32_t now = millis();
    portENTER_CRITICAL(&sourceMux);
    rtcmSource.state = BaseRtcmSourceState::TempPreparing;
    std::memcpy(rtcmSource.tempBaseMac, mac, sizeof(rtcmSource.tempBaseMac));
    rtcmSource.lastTempFrameAtMs = 0;
    rtcmSource.readyCycles = 0;
    tempSurveyReadyAtMs = now + surveyDurationSeconds * 1000UL +
                          TEMP_RTCM_SURVEY_GUARD_MS;
    tempCycleMsmMask = 0;
    tempCycleStarted = false;
    portEXIT_CRITICAL(&sourceMux);
    if (tempRtcmFrameQueue != nullptr) {
        xQueueReset(tempRtcmFrameQueue);
    }
    if (tempRtcmRxQueue != nullptr) {
        xQueueReset(tempRtcmRxQueue);
    }
    Serial.printf("[BASE][RTCM_SOURCE] state=TEMP_PREPARING temp=%s survey_s=%lu\n",
                  macToString(mac).c_str(),
                  static_cast<unsigned long>(surveyDurationSeconds));
}

void switchToLocalFallback(const char* reason)
{
    bool fallback = false;
    bool preparationCanceled = false;
    uint32_t epoch = 0;
    uint16_t activeStreamId = 0;
    portENTER_CRITICAL(&sourceMux);
    fallback = rtcmSource.state == BaseRtcmSourceState::TempActive;
    preparationCanceled = rtcmSource.state == BaseRtcmSourceState::TempPreparing;
    if (fallback) {
        rtcmSource.state = BaseRtcmSourceState::LocalFallback;
        ++rtcmSource.epoch;
        rtcmSource.lastTempFrameAtMs = 0;
        rtcmSource.readyCycles = 0;
        rotateDownstreamStreamLocked();
    } else if (preparationCanceled) {
        rtcmSource.state = BaseRtcmSourceState::LocalActive;
        std::memset(rtcmSource.tempBaseMac, 0, sizeof(rtcmSource.tempBaseMac));
        rtcmSource.lastTempFrameAtMs = 0;
        rtcmSource.readyCycles = 0;
    }
    epoch = rtcmSource.epoch;
    activeStreamId = streamId;
    portEXIT_CRITICAL(&sourceMux);
    if (!fallback && !preparationCanceled) {
        return;
    }
    if (tempRtcmFrameQueue != nullptr) {
        xQueueReset(tempRtcmFrameQueue);
    }
    if (tempRtcmRxQueue != nullptr) {
        xQueueReset(tempRtcmRxQueue);
    }
    if (fallback) {
        incrementStat(&BaseEspnowStats::sourceFallbacks);
        Serial.printf("[BASE][RTCM_SOURCE] state=LOCAL_FALLBACK epoch=%lu streamId=%u reason=%s\n",
                      static_cast<unsigned long>(epoch),
                      activeStreamId,
                      reason == nullptr ? "unknown" : reason);
    } else {
        Serial.printf("[BASE][RTCM_SOURCE] state=LOCAL_ACTIVE preparation_canceled reason=%s\n",
                      reason == nullptr ? "unknown" : reason);
    }
}

