NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
void activateTempSource()
{
    uint8_t mac[6] = {};
    uint32_t epoch = 0;
    uint16_t newId = 0;
    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state != BaseRtcmSourceState::TempPreparing) {
        portEXIT_CRITICAL(&sourceMux);
        return;
    }
    rtcmSource.state = BaseRtcmSourceState::TempActive;
    ++rtcmSource.epoch;
    rotateDownstreamStreamLocked();
    std::memcpy(mac, rtcmSource.tempBaseMac, sizeof(mac));
    epoch = rtcmSource.epoch;
    newId = streamId;
    portEXIT_CRITICAL(&sourceMux);
    incrementStat(&BaseEspnowStats::sourceSwitches);
    Serial.printf("[BASE][RTCM_SOURCE] state=TEMP_ACTIVE temp=%s epoch=%lu streamId=%u\n",
                  macToString(mac).c_str(),
                  static_cast<unsigned long>(epoch),
                  newId);
}

uint8_t msmBitForMessage(uint16_t messageId)
{
    switch (messageId) {
    case 1074: return 0x01;
    case 1084: return 0x02;
    case 1094: return 0x04;
    case 1124: return 0x08;
    default: return 0;
    }
}

void updateTempReadiness(uint16_t messageId, uint32_t now)
{
    bool shouldActivate = false;
    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state == BaseRtcmSourceState::TempPreparing &&
        static_cast<int32_t>(now - tempSurveyReadyAtMs) >= 0) {
        if (messageId == 1006) {
            if (tempCycleStarted && tempCycleMsmMask == 0x0F) {
                if (rtcmSource.readyCycles < UINT8_MAX) {
                    ++rtcmSource.readyCycles;
                }
            } else if (tempCycleStarted) {
                rtcmSource.readyCycles = 0;
            }
            tempCycleStarted = true;
            tempCycleMsmMask = 0;
        } else if (tempCycleStarted) {
            tempCycleMsmMask |= msmBitForMessage(messageId);
        }
        shouldActivate = rtcmSource.readyCycles >= TEMP_RTCM_READY_CYCLES;
    }
    portEXIT_CRITICAL(&sourceMux);
    if (shouldActivate) {
        activateTempSource();
    }
}

void makeRoverMacKey(size_t index, char* buffer, size_t bufferSize)
{
    snprintf(buffer, bufferSize, "%s%u",
             ESPNOW_NVS_ROVER_MAC_PREFIX,
             static_cast<unsigned>(index));
}

uint32_t localDeviceId()
{
    uint8_t mac[6] = {};
    if (esp_wifi_get_mac(WIFI_IF_STA, mac) != ESP_OK) {
        return 0;
    }
    return (static_cast<uint32_t>(mac[2]) << 24) |
           (static_cast<uint32_t>(mac[3]) << 16) |
           (static_cast<uint32_t>(mac[4]) << 8) |
           static_cast<uint32_t>(mac[5]);
}

bool addEspNowPeer(const uint8_t* mac, bool encrypted)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    esp_now_peer_info_t peerInfo = {};
    std::memcpy(peerInfo.peer_addr, mac, sizeof(peerInfo.peer_addr));
    peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    peerInfo.ifidx = WIFI_IF_STA;
    peerInfo.encrypt = encrypted;
    if (peerInfo.encrypt) {
        std::memcpy(peerInfo.lmk, ESPNOW_LMK, sizeof(peerInfo.lmk));
    }

    const esp_err_t result = esp_now_is_peer_exist(mac)
                                 ? esp_now_mod_peer(&peerInfo)
                                 : esp_now_add_peer(&peerInfo);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_add/mod_peer %s failed: %d\n",
                      macToString(mac).c_str(),
                      result);
        return false;
    }
    return true;
}

bool addRoverRuntimePeer(const uint8_t* mac, bool stored)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            roverPeers[index].stored = roverPeers[index].stored || stored;
            roverPeers[index].rtcmEnabled = true;
            roverPeers[index].consecutiveFrameFailures = 0;
            roverPeers[index].cooldownUntilMs = 0;
            portEXIT_CRITICAL(&peerMux);
            updatePeerStats();
            return true;
        }
    }

    if (roverPeerCount >= ESPNOW_MAX_PAIRED_ROVERS) {
        portEXIT_CRITICAL(&peerMux);
        Serial.printf("[BASE][PAIR][WARN] Rover list full, ignore %s\n",
                      macToString(mac).c_str());
        return false;
    }

    std::memcpy(roverPeers[roverPeerCount].mac, mac, 6);
    roverPeers[roverPeerCount].stored = stored;
    roverPeers[roverPeerCount].rtcmEnabled = true;
    roverPeers[roverPeerCount].consecutiveFrameFailures = 0;
    roverPeers[roverPeerCount].cooldownUntilMs = 0;
    ++roverPeerCount;
    portEXIT_CRITICAL(&peerMux);

    updatePeerStats();
    return addEspNowPeer(mac, ESPNOW_ENCRYPTION_ENABLED);
}

bool findRoverPeerIndex(const uint8_t* mac, size_t& selectedIndex)
{
    bool found = false;
    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            selectedIndex = index;
            found = true;
            break;
        }
    }
    portEXIT_CRITICAL(&peerMux);
    return found;
}

bool storeLatestRoverLlh(const uint8_t* roverMac,
                         const uint8_t* relayMac,
                         bool viaRelay,
                         uint32_t sequence,
                         int32_t latitudeE7,
                         int32_t longitudeE7,
                         int32_t heightMm,
                         uint8_t fixQuality)
{
    const uint32_t receivedAtMs = millis();
    const BaseRtcmSourceSnapshot source = getBaseRtcmSourceSnapshot();
    size_t selectedIndex = ESPNOW_MAX_LLH_SOURCES;
    size_t freeIndex = ESPNOW_MAX_LLH_SOURCES;
    portENTER_CRITICAL(&llhMux);
    for (size_t index = 0; index < ESPNOW_MAX_LLH_SOURCES; ++index) {
        if (latestRoverLlh[index].valid &&
            macEquals(latestRoverLlh[index].mac, roverMac)) {
            selectedIndex = index;
            break;
        }
        if (!latestRoverLlh[index].valid && freeIndex == ESPNOW_MAX_LLH_SOURCES) {
            freeIndex = index;
        }
    }
    if (selectedIndex == ESPNOW_MAX_LLH_SOURCES) {
        selectedIndex = freeIndex;
    }
    if (selectedIndex == ESPNOW_MAX_LLH_SOURCES) {
        portEXIT_CRITICAL(&llhMux);
        return false;
    }

    BaseRoverLlhStatus& latest = latestRoverLlh[selectedIndex];
    std::memcpy(latest.mac, roverMac, sizeof(latest.mac));
    if (viaRelay && relayMac != nullptr) {
        std::memcpy(latest.relayMac, relayMac, sizeof(latest.relayMac));
    } else {
        std::memset(latest.relayMac, 0, sizeof(latest.relayMac));
    }
    latest.viaRelay = viaRelay;
    latest.sequence = sequence;
    latest.latitudeE7 = latitudeE7;
    latest.longitudeE7 = longitudeE7;
    latest.heightMm = heightMm;
    latest.fixQuality = fixQuality;
    latest.usesTempBase = source.state == BaseRtcmSourceState::TempActive;
    if (latest.usesTempBase) {
        std::memcpy(latest.tempBaseMac,
                    source.tempBaseMac,
                    sizeof(latest.tempBaseMac));
    } else {
        std::memset(latest.tempBaseMac, 0, sizeof(latest.tempBaseMac));
    }
    latest.rtcmSourceEpoch = source.epoch;
    latest.receivedAtMs = receivedAtMs;
    latest.valid = true;
    portEXIT_CRITICAL(&llhMux);
    return true;
}

size_t copyRoverPeers(RoverPeer* destination, size_t capacity)
{
    portENTER_CRITICAL(&peerMux);
    const size_t count = roverPeerCount < capacity ? roverPeerCount : capacity;
    for (size_t index = 0; index < count; ++index) {
        destination[index] = roverPeers[index];
    }
    portEXIT_CRITICAL(&peerMux);
    return count;
}

bool saveRoverToNvs(const uint8_t* mac)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    Preferences preferences;
    if (!preferences.begin(ESPNOW_NVS_NAMESPACE, false)) {
        Serial.println("[BASE][PAIR][ERROR] Khong mo duoc NVS de luu Rover MAC");
        return false;
    }

