NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    uint8_t count = preferences.getUChar(ESPNOW_NVS_ROVER_COUNT_KEY, 0);
    for (uint8_t index = 0; index < count && index < ESPNOW_MAX_PAIRED_ROVERS; ++index) {
        char key[12] = {};
        uint8_t storedMac[6] = {};
        makeRoverMacKey(index, key, sizeof(key));
        if (preferences.getBytesLength(key) == 6 &&
            preferences.getBytes(key, storedMac, sizeof(storedMac)) == 6 &&
            macEquals(storedMac, mac)) {
            preferences.end();
            addRoverRuntimePeer(mac, true);
            return true;
        }
    }

    if (count >= ESPNOW_MAX_PAIRED_ROVERS) {
        preferences.end();
        Serial.println("[BASE][PAIR][ERROR] NVS rover list full");
        return false;
    }

    char key[12] = {};
    makeRoverMacKey(count, key, sizeof(key));
    const bool ok = preferences.putBytes(key, mac, 6) == 6 &&
                    preferences.putUChar(ESPNOW_NVS_ROVER_COUNT_KEY, count + 1) == 1;
    preferences.end();

    if (ok) {
        addRoverRuntimePeer(mac, true);
    }
    return ok;
}

void loadStoredRovers()
{
    Preferences preferences;
    if (!preferences.begin(ESPNOW_NVS_NAMESPACE, true)) {
        Serial.println("[BASE][PAIR][WARN] Khong mo duoc NVS de doc Rover MAC");
        return;
    }

    const uint8_t count = preferences.getUChar(ESPNOW_NVS_ROVER_COUNT_KEY, 0);
    for (uint8_t index = 0; index < count && index < ESPNOW_MAX_PAIRED_ROVERS; ++index) {
        char key[12] = {};
        uint8_t mac[6] = {};
        makeRoverMacKey(index, key, sizeof(key));
        if (preferences.getBytesLength(key) == 6 &&
            preferences.getBytes(key, mac, sizeof(mac)) == 6 &&
            macIsConfigured(mac)) {
            addRoverRuntimePeer(mac, true);
            Serial.println("[BASE][PAIR] Loaded Rover MAC from NVS: " + macToString(mac));
        }
    }
    preferences.end();
}

bool configureMaxTxPower()
{
    if (!WiFi.setTxPower(WIFI_POWER_19_5dBm)) {
        Serial.println("[BASE][WIFI][ERROR] Khong set duoc TX power 19.5 dBm");
        return false;
    }

    int8_t actualPower = 0;
    const esp_err_t result = esp_wifi_get_max_tx_power(&actualPower);
    if (result == ESP_OK) {
        Serial.printf("[BASE][WIFI] TX power fixed raw=%d dBm=%.2f\n",
                      actualPower,
                      actualPower / 4.0f);
    } else {
        Serial.printf("[BASE][WIFI][WARN] Khong doc duoc TX power: %d\n", result);
    }
    return true;
}

void drainSendCallbackSemaphore()
{
    while (xSemaphoreTake(sendCallbackSemaphore, 0) == pdTRUE) {
    }
}

bool sendControlPacket(const uint8_t* mac, const uint8_t* packet, size_t packetLength)
{
    if (espnowSendMutex == nullptr ||
        xSemaphoreTake(espnowSendMutex, pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    drainSendCallbackSemaphore();
    lastSendSucceeded = false;
    const esp_err_t sendResult = esp_now_send(mac, packet, packetLength);
    if (sendResult != ESP_OK) {
        xSemaphoreGive(espnowSendMutex);
        Serial.printf("[BASE][PAIR][ERROR] esp_now_send control failed: %d\n", sendResult);
        return false;
    }

    const BaseType_t callbackReceived =
        xSemaphoreTake(sendCallbackSemaphore, pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS));
    const bool succeeded = callbackReceived == pdTRUE && lastSendSucceeded;
    drainSendCallbackSemaphore();
    xSemaphoreGive(espnowSendMutex);
    return succeeded;
}

bool sendTempRtcmAck(const uint8_t* mac, uint16_t upstreamStreamId, uint32_t sequence)
{
    RtcmEspNowAck ack{};
    ack.magic = RTCM_ESPNOW_MAGIC;
    ack.version = RTCM_ESPNOW_VERSION;
    ack.packetType = RTCM_ESPNOW_PACKET_TYPE_TEMP_RTCM_ACK;
    ack.streamId = upstreamStreamId;
    ack.frameSequence = sequence;
    ack.status = RTCM_ESPNOW_ACK_STATUS_WRITTEN;
    if (!sendControlPacket(mac, reinterpret_cast<const uint8_t*>(&ack), sizeof(ack))) {
        incrementStat(&BaseEspnowStats::tempAckFailures);
        return false;
    }
    incrementStat(&BaseEspnowStats::tempAcksSent);
    return true;
}

bool validateTempFragmentHeader(const RtcmEspNowHeader& header, size_t packetLength)
{
    if (header.magic != RTCM_ESPNOW_MAGIC ||
        header.version != RTCM_ESPNOW_VERSION ||
        header.packetType != RTCM_ESPNOW_PACKET_TYPE_TEMP_RTCM_DATA ||
        header.frameLength < 6 || header.frameLength > RTCM_ESPNOW_MAX_FRAME_LENGTH ||
        header.fragmentCount == 0 ||
        header.fragmentCount > RTCM_ESPNOW_MAX_FRAGMENT_COUNT ||
        header.fragmentIndex >= header.fragmentCount) {
        return false;
    }
    const uint8_t expectedCount = static_cast<uint8_t>(
        (header.frameLength + RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD - 1) /
        RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD);
    const size_t offset = static_cast<size_t>(header.fragmentIndex) *
                          RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD;
    const size_t expectedPayload = min(RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD,
                                       static_cast<size_t>(header.frameLength) - offset);
    return header.fragmentCount == expectedCount &&
           header.payloadLength == expectedPayload &&
           packetLength == sizeof(RtcmEspNowHeader) + expectedPayload;
}

[[noreturn]] void tempRtcmReceiveTask(void*)
{
    TempRtcmReassemblyState reassembly{};
    bool haveCompleted = false;
    uint16_t completedStreamId = 0;
    uint32_t completedSequence = 0;

    while (true) {
        TempRtcmRxPacket packet{};
        if (tempRtcmRxQueue == nullptr ||
            xQueueReceive(tempRtcmRxQueue, &packet, pdMS_TO_TICKS(100)) != pdTRUE) {
            if (reassembly.active &&
                millis() - reassembly.startedAtMs > TEMP_RTCM_REASSEMBLY_TIMEOUT_MS) {
                reassembly = {};
                incrementStat(&BaseEspnowStats::tempFramesInvalid);
            }
            continue;
        }

        bool expectedSource = false;
        portENTER_CRITICAL(&sourceMux);
        expectedSource = (rtcmSource.state == BaseRtcmSourceState::TempPreparing ||
                          rtcmSource.state == BaseRtcmSourceState::TempActive) &&
                         macEquals(packet.sourceMac, rtcmSource.tempBaseMac);
        portEXIT_CRITICAL(&sourceMux);
        if (!expectedSource) {
            reassembly = {};
            continue;
        }

        RtcmEspNowHeader header{};
        std::memcpy(&header, packet.data, sizeof(header));
        if (!validateTempFragmentHeader(header, packet.length)) {
            incrementStat(&BaseEspnowStats::tempFramesInvalid);
            continue;
        }

        if (haveCompleted && header.streamId == completedStreamId &&
            header.frameSequence == completedSequence) {
            sendTempRtcmAck(packet.sourceMac, header.streamId, header.frameSequence);
            continue;
        }

        const bool sameFrame = reassembly.active &&
                               reassembly.streamId == header.streamId &&
                               reassembly.frameSequence == header.frameSequence;
        if (!sameFrame) {
            reassembly = {};
            reassembly.active = true;
            reassembly.streamId = header.streamId;
            reassembly.frameSequence = header.frameSequence;
            reassembly.frameLength = header.frameLength;
            reassembly.fragmentCount = header.fragmentCount;
            reassembly.startedAtMs = millis();
        } else if (reassembly.frameLength != header.frameLength ||
                   reassembly.fragmentCount != header.fragmentCount) {
            reassembly = {};
            incrementStat(&BaseEspnowStats::tempFramesInvalid);
            continue;
        }

