NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
        const uint8_t fragmentBit = static_cast<uint8_t>(1U << header.fragmentIndex);
        if ((reassembly.receivedMask & fragmentBit) == 0) {
            const size_t offset = static_cast<size_t>(header.fragmentIndex) *
                                  RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD;
            std::memcpy(reassembly.frame + offset,
                        packet.data + sizeof(RtcmEspNowHeader),
                        header.payloadLength);
            reassembly.receivedMask |= fragmentBit;
        }

        const uint8_t expectedMask = static_cast<uint8_t>(
            (1U << reassembly.fragmentCount) - 1U);
        if (reassembly.receivedMask != expectedMask) {
            continue;
        }

        if (!validateCompleteRtcmFrame(reassembly.frame, reassembly.frameLength)) {
            reassembly = {};
            incrementStat(&BaseEspnowStats::tempFramesInvalid);
            continue;
        }

        const uint32_t now = millis();
        const uint16_t messageId = rtcmMessageId(reassembly.frame, reassembly.frameLength);
        portENTER_CRITICAL(&sourceMux);
        rtcmSource.lastTempFrameAtMs = now;
        portEXIT_CRITICAL(&sourceMux);
        updateTempReadiness(messageId, now);

        BaseRtcmSourceSnapshot sourceSnapshot{};
        portENTER_CRITICAL(&sourceMux);
        sourceSnapshot = rtcmSource;
        portEXIT_CRITICAL(&sourceMux);

        bool accepted = sourceSnapshot.state == BaseRtcmSourceState::TempPreparing;
        if (sourceSnapshot.state == BaseRtcmSourceState::TempActive) {
            BaseTempRtcmFrame output{};
            output.length = reassembly.frameLength;
            output.messageId = messageId;
            output.receivedAtMs = now;
            std::memcpy(output.data, reassembly.frame, output.length);
            accepted = tempRtcmFrameQueue != nullptr &&
                       xQueueSend(tempRtcmFrameQueue, &output, 0) == pdTRUE;
            if (!accepted) {
                incrementStat(&BaseEspnowStats::tempQueueDrops);
            }
        }

        if (accepted) {
            incrementStat(&BaseEspnowStats::tempFramesValid);
            haveCompleted = true;
            completedStreamId = reassembly.streamId;
            completedSequence = reassembly.frameSequence;
            sendTempRtcmAck(packet.sourceMac,
                            reassembly.streamId,
                            reassembly.frameSequence);
        }
        reassembly = {};
    }
}

const char* gnssCommandName(uint8_t commandId)
{
    switch (commandId) {
    case RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN:
        return "switch_to_base_survey_in";
    case RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER:
        return "switch_to_rover";
    default:
        return "unknown";
    }
}

void setRoverRtcmEnabled(const uint8_t* mac, bool enabled)
{
    bool changed = false;
    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            changed = roverPeers[index].rtcmEnabled != enabled;
            roverPeers[index].rtcmEnabled = enabled;
            if (enabled) {
                roverPeers[index].consecutiveFrameFailures = 0;
                roverPeers[index].cooldownUntilMs = 0;
            }
            break;
        }
    }
    portEXIT_CRITICAL(&peerMux);
    if (changed) {
        updatePeerStats();
    }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataSent(const wifi_tx_info_t*, esp_now_send_status_t status)
#else
void onDataSent(const uint8_t*, esp_now_send_status_t status)
#endif
{
    lastSendSucceeded = (status == ESP_NOW_SEND_SUCCESS);
    if (sendCallbackSemaphore != nullptr) {
        xSemaphoreGive(sendCallbackSemaphore);
    }
}

void queuePairResponse(const uint8_t* sourceMac, const uint8_t* data, int length)
{
    if (!ESPNOW_PAIRING_ENABLED || sourceMac == nullptr || data == nullptr ||
        length != static_cast<int>(sizeof(RtcmEspNowPairResponse))) {
        return;
    }

    bool active = false;
    portENTER_CRITICAL(&pairingMux);
    active = pairingActive;
    if (active) {
        std::memcpy(&pendingPairResponsePacket, data, sizeof(pendingPairResponsePacket));
        std::memcpy(pendingPairResponseMac, sourceMac, sizeof(pendingPairResponseMac));
        pendingPairResponse = true;
    }
    portEXIT_CRITICAL(&pairingMux);
}

bool peerCooldownActive(const RoverPeer& peer, uint32_t now)
{
    return peer.cooldownUntilMs != 0 &&
           static_cast<int32_t>(now - peer.cooldownUntilMs) < 0;
}

void recordPeerDeliveryResult(const uint8_t* mac, bool delivered)
{
    bool enteredCooldown = false;
    bool recovered = false;
    uint8_t failureCount = 0;
    uint32_t cooldownMs = 0;
    const uint32_t now = millis();

    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        RoverPeer& peer = roverPeers[index];
        if (!macEquals(peer.mac, mac)) {
            continue;
        }
        if (delivered) {
            recovered = peer.consecutiveFrameFailures != 0 ||
                        peer.cooldownUntilMs != 0;
            peer.consecutiveFrameFailures = 0;
            peer.cooldownUntilMs = 0;
        } else {
            if (peer.consecutiveFrameFailures < UINT8_MAX) {
                ++peer.consecutiveFrameFailures;
            }
            failureCount = peer.consecutiveFrameFailures;
            if (peer.consecutiveFrameFailures >=
                ESPNOW_PEER_FAILURES_BEFORE_COOLDOWN) {
                peer.cooldownUntilMs = now + ESPNOW_PEER_FAILURE_COOLDOWN_MS;
                cooldownMs = ESPNOW_PEER_FAILURE_COOLDOWN_MS;
                enteredCooldown = true;
            }
        }
        break;
    }
    portEXIT_CRITICAL(&peerMux);

    if (enteredCooldown) {
        incrementStat(&BaseEspnowStats::peerCooldownEvents);
        Serial.printf("[BASE][ESP-NOW][PEER] mac=%s state=cooldown failures=%u duration_ms=%lu\n",
                      macToString(mac).c_str(),
                      static_cast<unsigned>(failureCount),
                      static_cast<unsigned long>(cooldownMs));
    } else if (recovered) {
        incrementStat(&BaseEspnowStats::peerRecoveries);
        Serial.printf("[BASE][ESP-NOW][PEER] mac=%s state=recovered\n",
                      macToString(mac).c_str());
    }
}

