NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
void queueTempRtcmFragment(const uint8_t* sourceMac, const uint8_t* data, int length)
{
    bool expectedSource = false;
    portENTER_CRITICAL(&sourceMux);
    expectedSource = (rtcmSource.state == BaseRtcmSourceState::TempPreparing ||
                      rtcmSource.state == BaseRtcmSourceState::TempActive) &&
                     macEquals(sourceMac, rtcmSource.tempBaseMac);
    portEXIT_CRITICAL(&sourceMux);
    if (!expectedSource || length < static_cast<int>(sizeof(RtcmEspNowHeader)) ||
        length > static_cast<int>(RTCM_ESPNOW_MAX_PACKET_SIZE)) {
        incrementStat(&BaseEspnowStats::tempFramesInvalid);
        return;
    }

    TempRtcmRxPacket packet{};
    std::memcpy(packet.sourceMac, sourceMac, sizeof(packet.sourceMac));
    packet.length = static_cast<uint16_t>(length);
    std::memcpy(packet.data, data, static_cast<size_t>(length));
    if (tempRtcmRxQueue == nullptr || xQueueSend(tempRtcmRxQueue, &packet, 0) != pdTRUE) {
        incrementStat(&BaseEspnowStats::tempQueueDrops);
        return;
    }
    incrementStat(&BaseEspnowStats::tempFragmentsReceived);
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataReceived(const esp_now_recv_info_t* info, const uint8_t* data, int length)
{
    const uint8_t* sourceMac = info == nullptr ? nullptr : info->src_addr;
#else
void onDataReceived(const uint8_t* sourceMac, const uint8_t* data, int length)
#endif
{
    if (sourceMac == nullptr || data == nullptr ||
        length < static_cast<int>(sizeof(RtcmEspNowCommonHeader))) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    RtcmEspNowCommonHeader common{};
    std::memcpy(&common, data, sizeof(common));
    if (common.magic != RTCM_ESPNOW_MAGIC || common.version != RTCM_ESPNOW_VERSION) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_PAIR_RESPONSE) {
        queuePairResponse(sourceMac, data, length);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_TEMP_RTCM_DATA) {
        queueTempRtcmFragment(sourceMac, data, length);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_ROVER_LLH_STATUS) {
        if (length != static_cast<int>(sizeof(RoverLlhStatusPacket))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        RoverLlhStatusPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        if (!rtcmEspNowValidateRoverLlhStatus(packet, sizeof(packet))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }

        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex)) {
            incrementStat(&BaseEspnowStats::llhStatusUnknownSource);
            return;
        }
        if (!storeLatestRoverLlh(sourceMac, nullptr, false,
                                 packet.sequence,
                                 packet.latitudeE7,
                                 packet.longitudeE7,
                                 packet.heightMm,
                                 packet.fixQuality)) {
            incrementStat(&BaseEspnowStats::llhStatusCapacityDrops);
            return;
        }
        incrementStat(&BaseEspnowStats::llhStatusReceived);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_RELAYED_ROVER_LLH_STATUS) {
        if (length != static_cast<int>(sizeof(RelayedRoverLlhStatusPacket))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        RelayedRoverLlhStatusPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        if (!rtcmEspNowValidateRelayedRoverLlhStatus(packet, sizeof(packet))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex)) {
            incrementStat(&BaseEspnowStats::llhStatusUnknownSource);
            return;
        }
        if (!storeLatestRoverLlh(packet.roverMac, sourceMac, true,
                                 packet.sequence,
                                 packet.latitudeE7,
                                 packet.longitudeE7,
                                 packet.heightMm,
                                 packet.fixQuality)) {
            incrementStat(&BaseEspnowStats::llhStatusCapacityDrops);
            return;
        }
        incrementStat(&BaseEspnowStats::llhStatusReceived);
        incrementStat(&BaseEspnowStats::llhStatusRelayedReceived);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_GNSS_COMMAND_RESULT) {
        if (length != static_cast<int>(sizeof(GnssCommandResultPacket))) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }
        GnssCommandResultPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex) ||
            !rtcmEspNowValidateGnssCommandResult(packet,
                                                 sizeof(packet),
                                                 ESPNOW_NETWORK_ID,
                                                 ESPNOW_PAIRING_KEY,
                                                 sizeof(ESPNOW_PAIRING_KEY))) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }

        bool matches = false;
        portENTER_CRITICAL(&gnssCommandMux);
        matches = waitingForGnssCommandResult &&
                  macEquals(sourceMac, expectedGnssCommandMac) &&
                  packet.transactionId == expectedGnssCommandTransactionId &&
                  packet.commandId == expectedGnssCommandId;
        portEXIT_CRITICAL(&gnssCommandMux);
        if (!matches) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }

