NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
        BaseGnssCommandResultEvent event{};
        std::memcpy(event.roverMac, sourceMac, sizeof(event.roverMac));
        event.transactionId = packet.transactionId;
        event.commandId = packet.commandId;
        event.status = packet.status;
        event.completedStep = packet.completedStep;
        event.totalSteps = packet.totalSteps;
        event.detailCode = packet.detailCode;
        event.receivedAtMs = millis();
        if (gnssCommandResultQueue != nullptr &&
            xQueueSend(gnssCommandResultQueue, &event, 0) != pdTRUE) {
            BaseGnssCommandResultEvent discarded{};
            xQueueReceive(gnssCommandResultQueue, &discarded, 0);
            xQueueSend(gnssCommandResultQueue, &event, 0);
        }
        incrementStat(&BaseEspnowStats::gnssCommandResults);
        if (packet.status == RTCM_ESPNOW_GNSS_COMMAND_STATUS_UART_SEQUENCE_WRITTEN) {
            const bool enableRtcm =
                packet.commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER;
            setRoverRtcmEnabled(sourceMac, enableRtcm);
            if (packet.commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER) {
                switchToLocalFallback("temp_base_returned_to_rover");
            }
            Serial.printf("[BASE][GNSS_CMD] RTCM delivery %s for peer %s action=%s\n",
                          enableRtcm ? "enabled" : "disabled",
                          macToString(sourceMac).c_str(),
                          gnssCommandName(packet.commandId));
        } else if (packet.commandId ==
                   RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN) {
            switchToLocalFallback("temp_base_command_rejected");
        }
        if (gnssCommandResultSemaphore != nullptr) {
            xSemaphoreGive(gnssCommandResultSemaphore);
        }
        return;
    }

    if (length != static_cast<int>(sizeof(RtcmEspNowAck))) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    RtcmEspNowAck ack{};
    std::memcpy(&ack, data, sizeof(ack));
    if (ack.packetType != RTCM_ESPNOW_PACKET_TYPE_FRAME_ACK ||
        ack.status != RTCM_ESPNOW_ACK_STATUS_WRITTEN) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (!waitingForFrameAck || !macEquals(sourceMac, expectedAckMac) ||
        ack.streamId != expectedAckStreamId ||
        ack.frameSequence != expectedAckSequence) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    incrementStat(&BaseEspnowStats::ackPacketsReceived);
    if (frameAckSemaphore != nullptr) {
        xSemaphoreGive(frameAckSemaphore);
    }
}

bool frameDeadlineExpired(uint32_t startedAt)
{
    return millis() - startedAt >= ESPNOW_FRAME_SEND_DEADLINE_MS;
}

bool sendPacketWithRetry(const uint8_t* peerMac,
                         const uint8_t* packet,
                         size_t packetLength,
                         uint32_t frameStartedAt)
{
    for (uint8_t attempt = 0; attempt <= ESPNOW_SEND_RETRY_COUNT; ++attempt) {
        if (frameDeadlineExpired(frameStartedAt)) {
            incrementStat(&BaseEspnowStats::frameDeadlineDrops);
            return false;
        }

        if (xSemaphoreTake(espnowSendMutex, pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS)) != pdTRUE) {
            incrementStat(&BaseEspnowStats::sendTimeouts);
            return false;
        }

        drainSendCallbackSemaphore();
        lastSendSucceeded = false;

        const esp_err_t sendResult = esp_now_send(peerMac, packet, packetLength);
        if (sendResult != ESP_OK) {
            xSemaphoreGive(espnowSendMutex);
            incrementStat(&BaseEspnowStats::sendFailures);
            Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_send %s failed: %d\n",
                          macToString(peerMac).c_str(),
                          sendResult);
            delay(5);
            continue;
        }

        const uint32_t elapsedMs = millis() - frameStartedAt;
        const uint32_t deadlineRemaining = elapsedMs < ESPNOW_FRAME_SEND_DEADLINE_MS
                                               ? ESPNOW_FRAME_SEND_DEADLINE_MS - elapsedMs
                                               : 0;
        const uint32_t waitMs = min(ESPNOW_SEND_TIMEOUT_MS, deadlineRemaining);
        const BaseType_t callbackReceived =
            waitMs > 0
                ? xSemaphoreTake(sendCallbackSemaphore, pdMS_TO_TICKS(waitMs))
                : pdFALSE;
        xSemaphoreGive(espnowSendMutex);

        if (callbackReceived == pdTRUE && lastSendSucceeded) {
            incrementStat(&BaseEspnowStats::fragmentsSent);
            return true;
        }

        if (waitMs == 0 || frameDeadlineExpired(frameStartedAt)) {
            incrementStat(&BaseEspnowStats::frameDeadlineDrops);
            return false;
        }

        if (callbackReceived != pdTRUE) {
            incrementStat(&BaseEspnowStats::sendTimeouts);
            Serial.println("[BASE][ESP-NOW][WARN] Send callback timeout");
            return false;
        } else {
            incrementStat(&BaseEspnowStats::sendFailures);
            Serial.println("[BASE][ESP-NOW][WARN] Send callback reported failure");
        }
        delay(5);
    }

    return false;
}

bool sendFrameToPeer(const uint8_t* peerMac,
                     const uint8_t* frame,
                     size_t length,
                     uint16_t currentStreamId,
                     uint32_t currentSequence)
{
    uint8_t packet[RTCM_ESPNOW_MAX_PACKET_SIZE] = {};
    const uint8_t fragmentCount = static_cast<uint8_t>(
        (length + RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD - 1) / RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD);

    while (xSemaphoreTake(frameAckSemaphore, 0) == pdTRUE) {
    }
    std::memcpy(expectedAckMac, peerMac, 6);
    expectedAckStreamId = currentStreamId;
    expectedAckSequence = currentSequence;
    waitingForFrameAck = true;

    for (uint8_t frameAttempt = 0; frameAttempt <= ESPNOW_FRAME_RETRY_COUNT; ++frameAttempt) {
        const uint32_t frameAttemptStartedAt = millis();
        bool allFragmentsSent = true;

        for (uint8_t fragmentIndex = 0; fragmentIndex < fragmentCount; ++fragmentIndex) {
            const size_t offset =
                static_cast<size_t>(fragmentIndex) * RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD;
            const size_t payloadLength = min(RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD, length - offset);

