NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
            auto* header = reinterpret_cast<RtcmEspNowHeader*>(packet);
            header->magic = RTCM_ESPNOW_MAGIC;
            header->version = RTCM_ESPNOW_VERSION;
            header->packetType = RTCM_ESPNOW_PACKET_TYPE_RTCM_DATA;
            header->streamId = currentStreamId;
            header->frameSequence = currentSequence;
            header->frameLength = static_cast<uint16_t>(length);
            header->fragmentIndex = fragmentIndex;
            header->fragmentCount = fragmentCount;
            header->payloadLength = static_cast<uint16_t>(payloadLength);

            std::memcpy(packet + sizeof(RtcmEspNowHeader), frame + offset, payloadLength);

            const size_t packetLength = sizeof(RtcmEspNowHeader) + payloadLength;
            if (!sendPacketWithRetry(peerMac, packet, packetLength, frameAttemptStartedAt)) {
                allFragmentsSent = false;
                Serial.printf("[BASE][ESP-NOW][WARN] Peer=%s seq=%lu attempt=%u stopped at fragment %u/%u\n",
                              macToString(peerMac).c_str(),
                              static_cast<unsigned long>(currentSequence),
                              frameAttempt + 1,
                              fragmentIndex + 1,
                              fragmentCount);
                break;
            }
        }

        BaseType_t ackReceived = xSemaphoreTake(frameAckSemaphore, 0);
        if (ackReceived != pdTRUE && allFragmentsSent) {
            ackReceived = xSemaphoreTake(frameAckSemaphore,
                                         pdMS_TO_TICKS(ESPNOW_FRAME_ACK_TIMEOUT_MS));
        }
        if (ackReceived == pdTRUE) {
            waitingForFrameAck = false;
            return true;
        }

        if (allFragmentsSent) {
            incrementStat(&BaseEspnowStats::frameAckTimeouts);
            Serial.printf("[BASE][ESP-NOW][WARN] Frame ACK timeout peer=%s seq=%lu attempt=%u\n",
                          macToString(peerMac).c_str(),
                          static_cast<unsigned long>(currentSequence),
                          frameAttempt + 1);
        }
        if (frameAttempt < ESPNOW_FRAME_RETRY_COUNT) {
            incrementStat(&BaseEspnowStats::frameRetries);
            delay(10);
        }
    }

    waitingForFrameAck = false;
    return false;
}

void setupPairingButton()
{
    if (!ESPNOW_PAIRING_ENABLED || pairingButtonReady) {
        return;
    }
    pinMode(PAIRING_BUTTON_PIN, PAIRING_BUTTON_ACTIVE_LOW ? INPUT_PULLUP : INPUT_PULLDOWN);
    pairingButtonReady = true;
    Serial.printf("[BASE][PAIR] Pairing button GPIO=%d active_%s hold_ms=%lu\n",
                  PAIRING_BUTTON_PIN,
                  PAIRING_BUTTON_ACTIVE_LOW ? "low" : "high",
                  static_cast<unsigned long>(PAIRING_BUTTON_HOLD_MS));
}

void startPairingMode()
{
    const uint32_t now = millis();
    portENTER_CRITICAL(&pairingMux);
    pairingActive = true;
    pendingPairResponse = false;
    pairingEndsAtMs = now + PAIRING_WINDOW_MS;
    pairingBaseNonce = esp_random();
    lastDiscoverySentAtMs = 0;
    portEXIT_CRITICAL(&pairingMux);
    setPairingActiveStat(true);
    Serial.printf("[BASE][PAIR] Pairing mode ON for %lu ms, network_id=0x%08lX\n",
                  static_cast<unsigned long>(PAIRING_WINDOW_MS),
                  static_cast<unsigned long>(ESPNOW_NETWORK_ID));
}

void stopPairingMode(const char* reason)
{
    portENTER_CRITICAL(&pairingMux);
    pairingActive = false;
    pendingPairResponse = false;
    portEXIT_CRITICAL(&pairingMux);
    setPairingActiveStat(false);
    Serial.print("[BASE][PAIR] Pairing mode OFF");
    if (reason != nullptr) {
        Serial.print(": ");
        Serial.print(reason);
    }
    Serial.println();
}

void sendPairDiscoveryIfDue()
{
    bool active = false;
    uint32_t nonce = 0;
    uint32_t lastSent = 0;
    const uint32_t now = millis();

    portENTER_CRITICAL(&pairingMux);
    active = pairingActive;
    nonce = pairingBaseNonce;
    lastSent = lastDiscoverySentAtMs;
    if (active && (lastSent == 0 || now - lastSent >= PAIR_DISCOVERY_INTERVAL_MS)) {
        lastDiscoverySentAtMs = now;
        lastSent = 0;
    }
    portEXIT_CRITICAL(&pairingMux);

    if (!active || lastSent != 0) {
        return;
    }

    RtcmEspNowPairDiscovery discovery{};
    discovery.common.magic = RTCM_ESPNOW_MAGIC;
    discovery.common.version = RTCM_ESPNOW_VERSION;
    discovery.common.packetType = RTCM_ESPNOW_PACKET_TYPE_PAIR_DISCOVERY;
    discovery.role = RTCM_ESPNOW_ROLE_BASE;
    discovery.networkId = ESPNOW_NETWORK_ID;
    discovery.baseDeviceId = localDeviceId();
    discovery.baseNonce = nonce;
    discovery.pairingWindowMs = PAIRING_WINDOW_MS;
    discovery.authTag = rtcmEspNowPairingAuthTag(discovery,
                                                 ESPNOW_PAIRING_KEY,
                                                 sizeof(ESPNOW_PAIRING_KEY));

    sendControlPacket(BROADCAST_MAC,
                      reinterpret_cast<const uint8_t*>(&discovery),
                      sizeof(discovery));
}

void processPendingPairResponse()
{
    RtcmEspNowPairResponse response{};
    uint8_t sourceMac[6] = {};
    uint32_t expectedNonce = 0;
    bool hasPending = false;

    portENTER_CRITICAL(&pairingMux);
    hasPending = pendingPairResponse;
    expectedNonce = pairingBaseNonce;
    if (hasPending) {
        response = pendingPairResponsePacket;
        std::memcpy(sourceMac, pendingPairResponseMac, sizeof(sourceMac));
        pendingPairResponse = false;
    }
    portEXIT_CRITICAL(&pairingMux);

    if (!hasPending) {
        return;
    }

    if (!rtcmEspNowValidatePairResponse(response,
                                        sizeof(response),
                                        ESPNOW_NETWORK_ID,
                                        expectedNonce,
                                        ESPNOW_PAIRING_KEY,
                                        sizeof(ESPNOW_PAIRING_KEY))) {
        incrementStat(&BaseEspnowStats::pairAuthFailures);
        Serial.println("[BASE][PAIR][WARN] Invalid PAIR_RESPONSE from " + macToString(sourceMac));
        return;
    }

    if (!addEspNowPeer(sourceMac, false)) {
        return;
    }

    RtcmEspNowPairConfirm confirm{};
    confirm.common.magic = RTCM_ESPNOW_MAGIC;
    confirm.common.version = RTCM_ESPNOW_VERSION;
    confirm.common.packetType = RTCM_ESPNOW_PACKET_TYPE_PAIR_CONFIRM;
    confirm.role = RTCM_ESPNOW_ROLE_BASE;
    confirm.networkId = ESPNOW_NETWORK_ID;
    confirm.baseNonce = response.baseNonceEcho;
    confirm.roverNonce = response.roverNonce;
    confirm.authTag = rtcmEspNowPairingAuthTag(confirm,
                                               ESPNOW_PAIRING_KEY,
                                               sizeof(ESPNOW_PAIRING_KEY));

