NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    esp_err_t result = esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_wifi_set_channel failed: %d\n", result);
        return false;
    }

    result = esp_now_init();
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_init failed: %d\n", result);
        return false;
    }

    result = esp_now_register_send_cb(onDataSent);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register send callback failed: %d\n", result);
        return false;
    }
    result = esp_now_register_recv_cb(onDataReceived);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register receive callback failed: %d\n", result);
        return false;
    }

    if (ESPNOW_ENCRYPTION_ENABLED) {
        result = esp_now_set_pmk(ESPNOW_PMK);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_set_pmk failed: %d\n", result);
            return false;
        }
    }

    if (ESPNOW_PAIRING_ENABLED) {
        addEspNowPeer(BROADCAST_MAC, false);
    }
    loadStoredRovers();
    updatePeerStats();
    const BaseEspnowStats loadedPeerStats = getBaseEspnowStats();
    if (loadedPeerStats.activeRoverCount == 0) {
        if (ESPNOW_PAIRING_ENABLED) {
            Serial.println("[BASE][PAIR][WARN] No Rover MAC in NVS; hold pairing button to pair");
        } else {
            Serial.println("[BASE][ESP-NOW][ERROR] No Rover MAC in NVS and pairing disabled");
            return false;
        }
    }

#if defined(WIFI_PHY_RATE_LORA_250K)
    if (ESPNOW_USE_LR_250KBPS) {
        result = esp_wifi_config_espnow_rate(WIFI_IF_STA, WIFI_PHY_RATE_LORA_250K);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][WARN] espnow LR rate config failed: %d\n", result);
        }
    }
#endif

    portENTER_CRITICAL(&sourceMux);
    streamId = newStreamId();
    frameSequence = 0;
    rtcmSource.state = BaseRtcmSourceState::LocalActive;
    rtcmSource.epoch = 1;
    portEXIT_CRITICAL(&sourceMux);

    if (xTaskCreatePinnedToCore(tempRtcmReceiveTask,
                                "Temp RTCM RX",
                                6144,
                                nullptr,
                                4,
                                nullptr,
                                1) != pdPASS) {
        Serial.println("[BASE][ESP-NOW][ERROR] Failed to create Temp RTCM RX task");
        return false;
    }

    Serial.println("[WIFI] STA radio ready for ESP-NOW; Internet transport starts separately");
    Serial.print("[WIFI] Local STA MAC: ");
    Serial.println(WiFi.macAddress());
    Serial.printf("[WIFI] ESP-NOW fixed channel: %u\n", ESPNOW_WIFI_CHANNEL);
    updatePeerStats();
    const BaseEspnowStats setupStats = getBaseEspnowStats();
    Serial.printf("[BASE][ESP-NOW] Ready, channel=%u, LR=%s, streamId=%u, rover_count=%lu\n",
                  ESPNOW_WIFI_CHANNEL,
                  ESPNOW_USE_LR_250KBPS ? "250 Kbps" : "off",
                  streamId,
                  static_cast<unsigned long>(setupStats.activeRoverCount));

    return true;
}

void baseEspNowLoop()
{
    const uint32_t sourceNow = millis();
    BaseRtcmSourceSnapshot sourceSnapshot{};
    uint32_t surveyReadyAt = 0;
    portENTER_CRITICAL(&sourceMux);
    sourceSnapshot = rtcmSource;
    surveyReadyAt = tempSurveyReadyAtMs;
    portEXIT_CRITICAL(&sourceMux);
    if (sourceSnapshot.state == BaseRtcmSourceState::TempActive &&
        sourceSnapshot.lastTempFrameAtMs != 0 &&
        sourceNow - sourceSnapshot.lastTempFrameAtMs > TEMP_RTCM_SOURCE_TIMEOUT_MS) {
        switchToLocalFallback("temp_rtcm_timeout");
    } else if (sourceSnapshot.state == BaseRtcmSourceState::TempPreparing &&
               static_cast<int32_t>(sourceNow - surveyReadyAt) >= 0 &&
               (sourceSnapshot.lastTempFrameAtMs == 0 ||
                sourceNow - sourceSnapshot.lastTempFrameAtMs >
                    TEMP_RTCM_PREPARING_TIMEOUT_MS)) {
        switchToLocalFallback("temp_not_ready");
    }

    if constexpr (ESPNOW_PAIRING_ENABLED) {
        static uint32_t pressedSinceMs = 0;
        static bool pairingStartHandled = false;
        const bool rawLevel = digitalRead(PAIRING_BUTTON_PIN) == HIGH;
        const bool pressed = PAIRING_BUTTON_ACTIVE_LOW ? !rawLevel : rawLevel;
        const uint32_t now = millis();

        if (pressed) {
            if (pressedSinceMs == 0) {
                pressedSinceMs = now;
            } else if (!pairingStartHandled &&
                       now - pressedSinceMs >= PAIRING_BUTTON_HOLD_MS) {
                startPairingMode();
                pairingStartHandled = true;
            }
        } else {
            pressedSinceMs = 0;
            pairingStartHandled = false;
        }

        bool active = false;
        uint32_t endsAt = 0;
        portENTER_CRITICAL(&pairingMux);
        active = pairingActive;
        endsAt = pairingEndsAtMs;
        portEXIT_CRITICAL(&pairingMux);
        if (active && static_cast<int32_t>(now - endsAt) >= 0) {
            stopPairingMode("timeout");
        }

        sendPairDiscoveryIfDue();
        processPendingPairResponse();
    }
    processNextGnssCommand();
}

bool baseEspNowSendRtcmFrame(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 6 || length > RTCM_ESPNOW_MAX_FRAME_LENGTH) {
        incrementStat(&BaseEspnowStats::framesDropped);
        return false;
    }

    const uint8_t fragmentCount = static_cast<uint8_t>(
        (length + RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD - 1) / RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD);
    if (fragmentCount == 0 || fragmentCount > RTCM_ESPNOW_MAX_FRAGMENT_COUNT) {
        incrementStat(&BaseEspnowStats::framesDropped);
        return false;
    }

    RoverPeer peers[ESPNOW_MAX_PAIRED_ROVERS] = {};
    const size_t peerCount = copyRoverPeers(peers, ESPNOW_MAX_PAIRED_ROVERS);
    if (peerCount == 0) {
        incrementStat(&BaseEspnowStats::framesDropped);
        Serial.println("[BASE][ESP-NOW][WARN] Drop RTCM frame: no paired Rover peer");
        return false;
    }

