NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    uint16_t currentStreamId = 0;
    uint32_t currentSequence = 0;
    portENTER_CRITICAL(&sourceMux);
    currentStreamId = streamId;
    currentSequence = frameSequence++;
    portEXIT_CRITICAL(&sourceMux);
    const uint32_t sendStartedAt = millis();
    bool allPeersAcked = true;
    size_t attemptedPeers = 0;
    const size_t startIndex = nextPeerStartIndex % peerCount;
    nextPeerStartIndex = (startIndex + 1) % peerCount;

    for (size_t offset = 0; offset < peerCount; ++offset) {
        const size_t index = (startIndex + offset) % peerCount;
        if (!peers[index].rtcmEnabled) {
            continue;
        }
        if (peerCooldownActive(peers[index], millis())) {
            incrementStat(&BaseEspnowStats::peerCooldownSkips);
            continue;
        }
        ++attemptedPeers;
        const bool delivered = sendFrameToPeer(peers[index].mac,
                                               frame,
                                               length,
                                               currentStreamId,
                                               currentSequence);
        recordPeerDeliveryResult(peers[index].mac, delivered);
        if (!delivered) {
            allPeersAcked = false;
            Serial.printf("[BASE][ESP-NOW][ERROR] Drop seq=%lu for peer=%s without application ACK\n",
                          static_cast<unsigned long>(currentSequence),
                          macToString(peers[index].mac).c_str());
        }
    }

    waitingForFrameAck = false;
    if (attemptedPeers == 0) {
        incrementStat(&BaseEspnowStats::framesDropped);
        const uint32_t now = millis();
        if (lastNoRtcmPeerWarningAtMs == 0 ||
            now - lastNoRtcmPeerWarningAtMs >= HEALTH_INTERVAL) {
            lastNoRtcmPeerWarningAtMs = now;
            Serial.println("[BASE][ESP-NOW][WARN] Drop RTCM frame: all RTCM peers disabled or in cooldown");
        }
        return false;
    }
    recordFrameSendDuration(millis() - sendStartedAt);

    if (allPeersAcked) {
        incrementStat(&BaseEspnowStats::framesSent);
        return true;
    }

    incrementStat(&BaseEspnowStats::framesDropped);
    return false;
}

BaseEspnowStats getBaseEspnowStats()
{
    updatePeerStats();
    portENTER_CRITICAL(&statsMux);
    const BaseEspnowStats copy = stats;
    portEXIT_CRITICAL(&statsMux);
    return copy;
}

uint16_t getBaseEspNowStreamId()
{
    portENTER_CRITICAL(&sourceMux);
    const uint16_t copy = streamId;
    portEXIT_CRITICAL(&sourceMux);
    return copy;
}

bool baseEspNowShouldForwardLocalRtcm()
{
    portENTER_CRITICAL(&sourceMux);
    const bool forward = rtcmSource.state != BaseRtcmSourceState::TempActive;
    portEXIT_CRITICAL(&sourceMux);
    return forward;
}

bool baseEspNowPopTempRtcmFrame(BaseTempRtcmFrame& frame, TickType_t waitTicks)
{
    return tempRtcmFrameQueue != nullptr &&
           xQueueReceive(tempRtcmFrameQueue, &frame, waitTicks) == pdTRUE;
}

BaseRtcmSourceSnapshot getBaseRtcmSourceSnapshot()
{
    portENTER_CRITICAL(&sourceMux);
    const BaseRtcmSourceSnapshot copy = rtcmSource;
    portEXIT_CRITICAL(&sourceMux);
    return copy;
}

const char* baseRtcmSourceStateToString(BaseRtcmSourceState state)
{
    switch (state) {
    case BaseRtcmSourceState::LocalActive: return "LOCAL_ACTIVE";
    case BaseRtcmSourceState::TempPreparing: return "TEMP_PREPARING";
    case BaseRtcmSourceState::TempActive: return "TEMP_ACTIVE";
    case BaseRtcmSourceState::LocalFallback: return "LOCAL_FALLBACK";
    default: return "UNKNOWN";
    }
}

size_t baseEspNowCopyLatestRoverLlh(BaseRoverLlhStatus* destination,
                                    size_t capacity)
{
    if (destination == nullptr || capacity == 0) {
        return 0;
    }
    const size_t count = ESPNOW_MAX_LLH_SOURCES < capacity
                             ? ESPNOW_MAX_LLH_SOURCES
                             : capacity;
    portENTER_CRITICAL(&llhMux);
    for (size_t index = 0; index < count; ++index) {
        destination[index] = latestRoverLlh[index];
    }
    portEXIT_CRITICAL(&llhMux);
    return count;
}

static BaseGnssCommandQueueResult queueRoverGnssCommand(
    uint8_t commandId,
    const uint8_t* requestedTargetMac,
    uint32_t transactionId,
    uint32_t surveyDurationSeconds,
    uint8_t selectedTargetMac[6])
{
    const bool validArguments =
        transactionId != 0 &&
        ((commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN &&
          surveyDurationSeconds >= RTCM_ESPNOW_GNSS_SURVEY_MIN_SECONDS &&
          surveyDurationSeconds <= RTCM_ESPNOW_GNSS_SURVEY_MAX_SECONDS) ||
         (commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER &&
          surveyDurationSeconds == 0));
    if (!validArguments) {
        return BaseGnssCommandQueueResult::InvalidArgument;
    }
    if (gnssCommandQueue == nullptr) {
        return BaseGnssCommandQueueResult::NotReady;
    }

    QueuedGnssCommand command{};
    bool targetFound = false;
    portENTER_CRITICAL(&peerMux);
    if (requestedTargetMac == nullptr && roverPeerCount > 0) {
        std::memcpy(command.roverMac, roverPeers[0].mac, sizeof(command.roverMac));
        targetFound = true;
    } else if (requestedTargetMac != nullptr) {
        for (size_t index = 0; index < roverPeerCount; ++index) {
            if (macEquals(roverPeers[index].mac, requestedTargetMac)) {
                std::memcpy(command.roverMac,
                            roverPeers[index].mac,
                            sizeof(command.roverMac));
                targetFound = true;
                break;
            }
        }
    }
    portEXIT_CRITICAL(&peerMux);
    if (!targetFound || !macIsConfigured(command.roverMac)) {
        if (requestedTargetMac != nullptr) {
            return BaseGnssCommandQueueResult::TargetNotPaired;
        }
        return BaseGnssCommandQueueResult::NoPairedRover;
    }
    command.transactionId = transactionId;
    command.surveyDurationSeconds = surveyDurationSeconds;
    command.commandId = commandId;
    if (xQueueSend(gnssCommandQueue, &command, 0) != pdTRUE) {
        return BaseGnssCommandQueueResult::QueueFull;
    }
    if (selectedTargetMac != nullptr) {
        std::memcpy(selectedTargetMac, command.roverMac, 6);
    }
    incrementStat(&BaseEspnowStats::gnssCommandQueued);
    return BaseGnssCommandQueueResult::Queued;
}

BaseGnssCommandQueueResult baseEspNowQueueFirstRoverBaseSurveyIn(
    uint32_t transactionId,
    uint32_t surveyDurationSeconds,
    uint8_t targetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN,
        nullptr,
        transactionId,
        surveyDurationSeconds,
        targetMac);
}

