NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
BaseGnssCommandQueueResult baseEspNowQueueFirstRoverMode(
    uint32_t transactionId,
    uint8_t targetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
        nullptr,
        transactionId,
        0,
        targetMac);
}

BaseGnssCommandQueueResult baseEspNowQueueRoverBaseSurveyIn(
    const uint8_t requestedTargetMac[6],
    uint32_t transactionId,
    uint32_t surveyDurationSeconds,
    uint8_t selectedTargetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN,
        requestedTargetMac,
        transactionId,
        surveyDurationSeconds,
        selectedTargetMac);
}

BaseGnssCommandQueueResult baseEspNowQueueRoverMode(
    const uint8_t requestedTargetMac[6],
    uint32_t transactionId,
    uint8_t selectedTargetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
        requestedTargetMac,
        transactionId,
        0,
        selectedTargetMac);
}

bool baseEspNowPopGnssCommandResult(BaseGnssCommandResultEvent& result)
{
    return gnssCommandResultQueue != nullptr &&
           xQueueReceive(gnssCommandResultQueue, &result, 0) == pdTRUE;
}

const char* baseGnssCommandQueueResultToString(BaseGnssCommandQueueResult result)
{
    switch (result) {
    case BaseGnssCommandQueueResult::Queued: return "queued";
    case BaseGnssCommandQueueResult::InvalidArgument: return "invalid_argument";
    case BaseGnssCommandQueueResult::NotReady: return "not_ready";
    case BaseGnssCommandQueueResult::NoPairedRover: return "no_paired_rover";
    case BaseGnssCommandQueueResult::TargetNotPaired: return "target_not_paired";
    case BaseGnssCommandQueueResult::QueueFull: return "queue_full";
    default: return "unknown";
    }
}
